ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_dma.cpp
/**
  ******************************************************************************
  * @file    stm32f10x_dma.c
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    11-March-2011
  * @brief   This file provides all the DMA firmware functions.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_rcc.h"
#include "stm32f10x_dma.h"
uint16_t DMA::ObjectNum[2] = {0,0};

/** @addtogroup STM32F10x_StdPeriph_Driver
  * @{
  */

/** @defgroup DMA
  * @brief DMA driver modules
  * @{
  */

/** @defgroup DMA_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */

/** @defgroup DMA_Private_Defines
  * @{
  */


/* DMA1 Channelx interrupt pending bit masks */
#define DMA1_Channel1_IT_Mask    ((uint32_t)(DMA_ISR_GIF1 | DMA_ISR_TCIF1 | DMA_ISR_HTIF1 | DMA_ISR_TEIF1))
#define DMA1_Channel2_IT_Mask    ((uint32_t)(DMA_ISR_GIF2 | DMA_ISR_TCIF2 | DMA_ISR_HTIF2 | DMA_ISR_TEIF2))
#define DMA1_Channel3_IT_Mask    ((uint32_t)(DMA_ISR_GIF3 | DMA_ISR_TCIF3 | DMA_ISR_HTIF3 | DMA_ISR_TEIF3))
#define DMA1_Channel4_IT_Mask    ((uint32_t)(DMA_ISR_GIF4 | DMA_ISR_TCIF4 | DMA_ISR_HTIF4 | DMA_ISR_TEIF4))
#define DMA1_Channel5_IT_Mask    ((uint32_t)(DMA_ISR_GIF5 | DMA_ISR_TCIF5 | DMA_ISR_HTIF5 | DMA_ISR_TEIF5))
#define DMA1_Channel6_IT_Mask    ((uint32_t)(DMA_ISR_GIF6 | DMA_ISR_TCIF6 | DMA_ISR_HTIF6 | DMA_ISR_TEIF6))
#define DMA1_Channel7_IT_Mask    ((uint32_t)(DMA_ISR_GIF7 | DMA_ISR_TCIF7 | DMA_ISR_HTIF7 | DMA_ISR_TEIF7))

/* DMA2 Channelx interrupt pending bit masks */
#define DMA2_Channel1_IT_Mask    ((uint32_t)(DMA_ISR_GIF1 | DMA_ISR_TCIF1 | DMA_ISR_HTIF1 | DMA_ISR_TEIF1))
#define DMA2_Channel2_IT_Mask    ((uint32_t)(DMA_ISR_GIF2 | DMA_ISR_TCIF2 | DMA_ISR_HTIF2 | DMA_ISR_TEIF2))
#define DMA2_Channel3_IT_Mask    ((uint32_t)(DMA_ISR_GIF3 | DMA_ISR_TCIF3 | DMA_ISR_HTIF3 | DMA_ISR_TEIF3))
#define DMA2_Channel4_IT_Mask    ((uint32_t)(DMA_ISR_GIF4 | DMA_ISR_TCIF4 | DMA_ISR_HTIF4 | DMA_ISR_TEIF4))
#define DMA2_Channel5_IT_Mask    ((uint32_t)(DMA_ISR_GIF5 | DMA_ISR_TCIF5 | DMA_ISR_HTIF5 | DMA_ISR_TEIF5))

/* DMA2 FLAG mask */
#define FLAG_Mask                ((uint32_t)0x10000000)

/* DMA registers Masks */
#define CCR_CLEAR_Mask           ((uint32_t)0xFFFF800F)

/**
  * @}
  */

/** @defgroup DMA_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup DMA_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup DMA_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

void DMA::Increase(void)
{
	switch((uint32_t)DMAy_Channelx)
	{
		case DMA1_Channel1_BASE:
		case DMA1_Channel2_BASE:
		case DMA1_Channel3_BASE:
		case DMA1_Channel4_BASE:
		case DMA1_Channel5_BASE:
		case DMA1_Channel6_BASE:
		case DMA1_Channel7_BASE:
			ObjectNum[0]++;
			break;
		case DMA2_Channel1_BASE:
		case DMA2_Channel2_BASE:
		case DMA2_Channel3_BASE:
		case DMA2_Channel4_BASE:
		case DMA2_Channel5_BASE:
			ObjectNum[1]++;
			break;
	}
}

uint16_t DMA::Decrease(void)
{
	switch((uint32_t)DMAy_Channelx)
	{
		case DMA1_Channel1_BASE:
		case DMA1_Channel2_BASE:
		case DMA1_Channel3_BASE:
		case DMA1_Channel4_BASE:
		case DMA1_Channel5_BASE:
		case DMA1_Channel6_BASE:
		case DMA1_Channel7_BASE:
			return --ObjectNum[0];
		case DMA2_Channel1_BASE:
		case DMA2_Channel2_BASE:
		case DMA2_Channel3_BASE:
		case DMA2_Channel4_BASE:
		case DMA2_Channel5_BASE:
			return --ObjectNum[1];
	}
	return 0xFFFF;
}

DMA::DMA(InitTypeDef& InitStruct)
{
	this->Increase();
	this->Init(InitStruct);
	this->On();
}

DMA::DMA(DMA_Channel_TypeDef* _DMAy_Channelx, InitTypeDef& InitStruct) :DMAy_Channelx(_DMAy_Channelx)
{
	this->Increase();
	this->Init(InitStruct);
	this->On();
}

DMA::DMA(DMA_Channel_TypeDef* _DMAy_Channelx, uint32_t PeripheralBaseAddr, uint32_t MemoryBaseAddr, uint32_t DIR, uint32_t BufferSize, uint32_t PeripheralInc, uint32_t MemoryInc, uint32_t PeripheralDataSize, uint32_t MemoryDataSize, uint32_t Mode, uint32_t Priority, uint32_t M2M) :DMAy_Channelx(_DMAy_Channelx)
{
	DMA::InitTypeDef aaa;
	this->Increase();
	aaa.PeripheralBaseAddr = PeripheralBaseAddr;
	aaa.MemoryBaseAddr = MemoryBaseAddr;
	aaa.DIR = DIR;
	aaa.BufferSize = BufferSize;
	aaa.PeripheralInc = PeripheralInc;
	aaa.MemoryInc = MemoryInc;
	aaa.PeripheralDataSize = PeripheralDataSize;
	aaa.MemoryDataSize = MemoryDataSize;
	aaa.Mode = Mode;
	aaa.Priority = Priority;
	aaa.M2M = M2M;
	this->Init(aaa);
	this->On();
}

DMA::DMA(const DMA& Other)
{
	this->DMAy_Channelx = Other.DMAy_Channelx;
	this->Increase();
}

void DMA::On()
{
	this->Cmd(ENABLE);   //启动外设
}

void DMA::Off()
{
	this->Cmd(DISABLE);   //关闭外设
}

DMA_Channel_TypeDef* DMA::GetPeriphPointer(void)
{
	return this->DMAy_Channelx;
}

/** @defgroup DMA_Private_Functions
  * @{
  */
DMA::~DMA()
{
	if(this->Decrease()==0)
	{
		this->Off();
		RCC::ClockCmd(*this,DISABLE);
	}
}
/**
  * @brief  Deinitializes the DMAy Channelx registers to their default reset
  *         values.
  * @param  DMAy_Channelx: where y can be 1 or 2 to select the DMA and
  *   x can be 1 to 7 for DMA1 and 1 to 5 for DMA2 to select the DMA Channel.
  * @retval None
  */
void DMA::DeInit(void)
{
	/* Check the parameters */
	assert_param(IS_DMA_ALL_PERIPH(DMAy_Channelx));

	/* Disable the selected DMAy Channelx */
	DMAy_Channelx->CCR &= (uint16_t)(~DMA_CCR1_EN);

	/* Reset DMAy Channelx control register */
	DMAy_Channelx->CCR  = 0;

	/* Reset DMAy Channelx remaining bytes register */
	DMAy_Channelx->CNDTR = 0;

